// date.cpp
// программа, ввода и вывода даты в формате 31/12/2002
#include <iostream>
using namespace std;
//////////////////////////////////////////////////////
struct Date // объявление структуры
{
    int day;  // день
    int month; // месяц
    int year; // год
};
//////////////////////////////////////////////////////
int main()
{
    Date d; // определение структурной переменной Date
    char ch1, ch2; // символьные переменные для запроса
    // запрос значений даты в формате 31/12/2002
    cout << "Введите число месяц и год в формате 31/12/2002:" << endl;
    cin >> d.day >> ch1 >> d.month >> ch2 >> d.year;
    // Вывод даты во введенном формате
    cout << "Введенная дата " << d.day << ch1 << d.month << ch2 << d.year << endl;
    return 0;
}