// pointToArea.cpp
// программа точки на плоскости
#include <iostream>
using namespace std;
//////////////////////////////////////////////////////
struct Point // объявление структуры
{
    int x; // координата по оси абсцисс 
    int y;  // координата по оси ординат
};
//////////////////////////////////////////////////////
int main()
{
    Point p1, p2, p3; // определение структурной переменной

    // вывод значений полей на экран
    cout << "Введите координаты точки p1:";
    cin >> p1.x >> p1.y;
    cout << "Введите координаты точки p2:";
    cin >> p2.x >> p2.y;
    p3.x = p1.x + p2.x;
    p3.y = p1.y + p2.y;
    cout << "Координаты точки p1 + p2 равны "  
    << p3.x << ", " << p3.y << endl;
    return 0;
}